classroom = {'CS101': 3004, 'CS102':4501, 'CS103': 6755, 'CS104': 1244, 'CS105': 1411}
teacher = {'CS101': 'Хайис', 'CS102': 'Альварадо', 'CS103': 'Рич', 'NT110': 'Берк', 'CV241': 'Ли'}
time = {'CS101': '8:00', 'CS102': '9:00', 'CS103': '10:00', 'NT110': '11:00', 'CV241': '13:00'}

course = input('Введите номер курса: ')

print('Аудитория №:', classroom.get(course, 'Для данного курса аудитория не определена'),
      '\nПреподаватель:', teacher.get(course, 'Для данного курса преподаватель не определён'),
      '\nВремя:', time.get(course, 'Для данного курса время не определено'))