
capitals = {'Адыгея': 'Майкоп',	'Республика Алтай': 'Горно-Алтайск', 'Башкортостан': 'Уфа',
            'Бурятия': 'Улан-Удэ', 'Дагестан': 'Махачкала',	'Ингушетия': 'Магас',
            'Кабардино-Балкария': 'Нальчик', 'Калмыкия': 'Элиста', 'Карачаево-Черкесия': 'Черкесск',
            'Карелия': 'Петрозаводск', 'Республика Коми': 'Сыктывкар', 'Марий Эл': 'Йошкар-Ола',
            'Мордовия': 'Саранск', 'Якутия': 'Якутск', 'Северная Осетия': 'Владикавказ',
            'Татарстан': 'Казань', 'Тыва': 'Кызыл', 'Удмуртия': 'Ижевск', 'Хакасия': 'Абакан',
            'Чечня': 'Грозный', 'Чувашия': 'Чебоксары', 'Алтайский край': 'Барнаул',
            'Забайкальский край': 'Чита', 'Камчатский край': 'Петропавловск-Камчатский',
            'Краснодарский край': 'Краснодар', 'Красноярский край': 'Красноярск',
            'Пермский край': 'Пермь', 'Приморский край': 'Владивосток',
            'Ставропольский край': 'Ставрополь', 'Хабаровский край': 'Хабаровск',
            'Амурская область': 'Благовещенск',Архангельская область	 Архангельск	294,42	↘298 617	11401
36	 Астраханская область	 Астрахань	208,70	↘468 842	12401
37	 Белгородская область	 Белгород	153,1	↘333 931	14401
38	 Брянская область	 Брянск	186,73	↘375 669	15401
39	 Владимирская область	 Владимир	137,14	↘346 771	17401
40	 Волгоградская область	 Волгоград	859,353	↘1 025 662	18401
41	 Вологодская область	 Вологда	116	↘311 628	19401000000
42	 Воронежская область	 Воронеж	596,51	↘1 051 995	20401
43	 Запорожская область	 Мелитополь	49,69	149 926	0
44	 Ивановская область	 Иваново	104,84	↘360 687	24401
45	 Иркутская область	 Иркутск	277	↘611 215	25401
46	 Калининградская область	 Калининград	224,7	↘489 735	27401000000
47	 Калужская область	 Калуга	168,8	↘333 954	29401
48	 Кемеровская область	 Кемерово	294,8	↘549 362	32401
49	 Кировская область	 Киров	169,73	↗471 754	33401
50	 Костромская область	 Кострома	144,5	↘265 959	34401000000
51	 Курганская область	 Курган	393,03	↘305 505	37401
52	 Курская область	 Курск	208,2	↘434 703	38401
53	 Ленинградская область	Шаблон:Флагификация/Гатчина	28,75	↘5 600 044	41420
54	 Липецкая область	 Липецк	330,15	↘490 428	42401
55	 Магаданская область	 Магадан	295	↘89 834	44401
56	 Московская область	 Москва	25,65	↗13 104 177	46439
57	 Мурманская область	 Мурманск	154,4	↘267 422	47401
58	 Нижегородская область	 Нижний Новгород	410,68	↘1 213 477	22401
59	 Новгородская область	 Великий Новгород	90,08	↘223 191	49401
60	 Новосибирская область	 Новосибирск	502,7	↗1 635 338	50401
61	 Омская область	 Омск	577,9	↘1 110 836	52401
62	 Оренбургская область	 Оренбург	259	↘539 236	53401
63	 Орловская область	 Орёл	121,2	↘296 633	54401
64	 Пензенская область	 Пенза	304,56	↘492 376	56401
65	 Псковская область	 Псков	95,6	↘189 315	58401
66	 Ростовская область	 Ростов-на-Дону	348,5	↘1 135 968	60401
67	 Рязанская область	 Рязань	224,163	↘523 203	61401
68	 Самарская область	 Самара	541,4	↘1 163 645	36401
69	 Саратовская область	 Саратов	394	↘891 898	63701000001
70	 Сахалинская область	 Южно-Сахалинск	164,66	↘180 467	64401
71	 Свердловская область	 Екатеринбург	493	↘1 539 371	65401
72	 Смоленская область	 Смоленск	166,35	↘312 896	66401
73	 Тамбовская область	 Тамбов	99,8	↘258 546	68401
74	 Тверская область	 Тверь	152,22	↘414 756	28401
75	 Томская область	 Томск	294,6	↘551 505	69401
76	 Тульская область	 Тула	145,8	↘466 609	70401
77	 Тюменская область	 Тюмень	698	↗855 618	71401
78	 Ульяновская область	 Ульяновск	316	↘613 334	73401000000
79	 Херсонская область	 Херсон	49,69	↘279 000	0
80	 Челябинская область	 Челябинск	500,91	↘1 182 517	75401
81	 Ярославская область	 Ярославль	205,80	↘570 824	78401
Города федерального значения
82	 Москва	 Москва	2561,5	↗13 104 177	45
83	 Санкт-Петербург	 Санкт-Петербург	1439	↘5 600 044	40
84	 Севастополь[1]	 Севастополь	863,6	↗558 273	67
Автономная область
85	 Еврейская автономная область	 Биробиджан	169,38	↘68 536	99401
Автономные округа
86	 Ненецкий автономный округ	 Нарьян-Мар	45,13	↗23 579	11111
87	 Ханты-Мансийский автономный округ — Югра	 Ханты-Мансийск	337,76	↗109 745	71131
88	 Чукотский автономный округ	 Анадырь	20	↘12 998	77401
89	 Ямало-Ненецкий автономный округ	 Салехард}